README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-23 Thu 10:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spike-rs</title>
<meta name="author" content="Leonardo Mascelli" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Spike-rs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org33d242a">1. Introduction</a></li>
<li><a href="#org53eab2e">2. Structure of the project</a></li>
<li><a href="#org66c977a">3. Build instruction</a>
<ul>
<li><a href="#org89c1922">3.1. Requirements</a></li>
<li><a href="#org90ca4d3">3.2. Set the environment variables</a></li>
<li><a href="#org11a491d">3.3. Setup a virtual environment (optional)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org33d242a" class="outline-2">
<h2 id="org33d242a"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The goal of this project is to provide a fast library for the computational
part of the analysis, like the conversion of the ADC data, the spikes
detection and any sort of operation with data that requires iterating through
them. The core of the library is written in Rust but it's then wrapped in a
Python module to be easily used in an analisys workflow.
</p>

<p>
At the moment no GUI is provided with the library but a collection of example
scripts will be provided to be modified as needed.
</p>
</div>
</div>
<div id="outline-container-org53eab2e" class="outline-2">
<h2 id="org53eab2e"><span class="section-number-2">2.</span> Structure of the project</h2>
<div class="outline-text-2" id="text-2">
<p>
The library itself it's composed of three components:
</p>

<ul class="org-ul">
<li><b>spike-rs</b>: written in Rust, a modern and safe alternative to C/C++ that
provide the same performance but also avoids some common mistakes and
provides nice compilation errors. Almost all the code is build just on
standard library.</li>

<li><b>c_pycode</b>: written in pure C, it's responsible for all the operations on
I/O with the stored data. It's linked with the hdf5 library.</li>

<li><b>pycode</b>: That's the actual python library that wraps the C and Rust
functions. For the creation of the Python wrapper an external dependency
<a href="https://pyo3.rs">PyO3</a> is being used.</li>
</ul>
</div>
</div>
<div id="outline-container-org66c977a" class="outline-2">
<h2 id="org66c977a"><span class="section-number-2">3.</span> Build instruction</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org89c1922" class="outline-3">
<h3 id="org89c1922"><span class="section-number-3">3.1.</span> Requirements</h3>
<div class="outline-text-3" id="text-3-1">
<p>
To build the library you'll need:
</p>
<ul class="org-ul">
<li>the <b>rust</b> toolchain installed: <a href="https://www.rust-lang.org/tools/install">Rust download</a></li>
<li>a C compiler compatible with the hdf5 library (usually MSVC on Windows and
gcc on Linux)</li>
<li><b>hdf5</b> library: <a href="https://github.com/HDFGroup/hdf5/releases/latest">hdf5 download</a> 
(unzip it in a folder: you'll need that path later)</li>
<li>a python interpreter</li>
</ul>

<p>
<b>Windows</b>
Installing the Rust toolchain should be enough to get bot the rust and the c
tools needed. There are several python distribution like 
WinPython]] or <a href="https://www.anaconda.com/">Anaconda</a>.
Choose the one you prefer.
</p>

<p>
<b>Linux</b>
Depending on you distro you can install the rust toolchain with your
package manager or by using the install script from the rust project.
Usually both the c compiler and a python environment are already bundle in
the linux installation.
</p>
</div>
</div>
<div id="outline-container-org90ca4d3" class="outline-3">
<h3 id="org90ca4d3"><span class="section-number-3">3.2.</span> Set the environment variables</h3>
<div class="outline-text-3" id="text-3-2">
<p>
To compile the library the path of the hdf5 binaries and include files are
needed. So you'll need to set those environment variables:
</p>

<ul class="org-ul">
<li><b>HDF5_LIB_DIR</b>: path of the <i>lib</i> directory of the downloaded hdf5
library</li>

<li><p>
<b>HDF5_INCLUDE_DIR</b>:  path of the <i>include</i> directory of the downloaded
hdf5 library
</p>

<p>
For testing purpose there is a <i>build.ps1</i> PowerShell script that can be modified
and already has those variables defined. You can update their value with the
correct path for your machine and use it for building the library.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org11a491d" class="outline-3">
<h3 id="org11a491d"><span class="section-number-3">3.3.</span> Setup a virtual environment (optional)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
For the integration of python and rust code i've used a tool provided by the same mainteiners of PyO3, <a href="https://github.com/PyO3/maturin">maturin</a>, that makes easy to build and publish a mix of python and rust code. Those steps are not mandatory but i suggest you to use this tool too because it's a matter of a couple of commands and you'll have a ready to install python wheel or a virtual environment where to test the code.
</p>

<p>
Once you have a python interpreter installed lets create a virtual environment with maturin and all the needed libraries to use pycode. In a shell run
</p>

<p>
(I suppose you're using PowerShell as shell, if it's not the case change the command that differ for your shell or use PowerShell)
</p>

<pre class="example" id="orgfafff19">
python -m venv .venv
.venv/Scripts/Activate.ps1
pip install maturin numpy matplotlib scipy
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-02-12 Mon 00:00</p>
<p class="author">Author: Leonardo Mascelli</p>
<p class="date">Created: 2025-01-23 Thu 10:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
